## Upload data

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from time import time

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [3]:
green_df = pd.read_csv('green_tripdata.csv')
green_df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

In [4]:
green_df['lpep_pickup_datetime'] = pd.to_datetime(green_df.lpep_pickup_datetime)
green_df['lpep_dropoff_datetime'] = pd.to_datetime(green_df.lpep_dropoff_datetime)

# print(pd.io.sql.get_schema(green_df, name='green_taxi_data', con=engine))

In [5]:
green_df_iter = pd.read_csv('green_tripdata.csv', iterator=True, chunksize=100000)

In [6]:
df = next(green_df_iter)

df['lpep_pickup_datetime'] = pd.to_datetime(df.lpep_pickup_datetime)
df['lpep_dropoff_datetime'] = pd.to_datetime(df.lpep_dropoff_datetime)

df.head(n=0).to_sql(name='green_taxi_data', con=engine, if_exists='replace')

0

In [7]:
%time df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

CPU times: user 2.69 s, sys: 70.7 ms, total: 2.76 s
Wall time: 5.11 s

1000

In [8]:
while True:
    
    try:
        t_start = time()

        df = next(green_df_iter)

        df['lpep_pickup_datetime'] = pd.to_datetime(df.lpep_pickup_datetime)
        df['lpep_dropoff_datetime'] = pd.to_datetime(df.lpep_dropoff_datetime)

        df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

        t_end = time()

        print(f'inserted another chunk..., took %.3f second {t_end - t_start}')
    except StopIteration:
        break

inserted another chunk..., took %.3f second 5.0620458126068115
inserted another chunk..., took %.3f second 5.012029647827148
inserted another chunk..., took %.3f second 5.111825704574585
inserted another chunk..., took %.3f second 4.9321887493133545
inserted another chunk..., took %.3f second 5.271365165710449
inserted another chunk..., took %.3f second 1.6850948333740234

In [9]:
zone_df = pd.read_csv('zone_lookup.csv')

zone_df.to_sql(name='zones', con=engine, if_exists='replace')

265

In [28]:
zone_df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

## SQL queries

#### How many taxi trips were totally made on January 15?

In [11]:
query = """
SELECT 
    count(*) AS trip_count
FROM green_taxi_data
WHERE true 
    AND date(lpep_pickup_datetime) = '2019-01-15'
    AND date(lpep_dropoff_datetime) = '2019-01-15';
"""

pd.read_sql(query, con=engine)

   trip_count
0       20530

#### Which was the day with the largest trip distance?

In [17]:
query = """
SELECT 
    *
FROM green_taxi_data
WHERE trip_distance =  (
        SELECT 
            max(trip_distance)
        FROM green_taxi_data
    )
"""

pd.read_sql(query, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,297377,2,2019-01-15 19:27:58,2019-01-15 22:59:01,N,1,221,265,1,117.99,...,1.0,0.5,0.0,10.5,None,0.3,339.2,2,1,None

#### In 2019-01-01 how many trips had 2 and 3 passengers?

In [27]:
query = """
SELECT 
    '2' AS passengers
    , count(*) 
FROM green_taxi_data
WHERE true
    AND date(lpep_pickup_datetime) = '2019-01-01'
    AND passenger_count = 2
    
UNION

SELECT 
    '3' AS passengers
    , count(*) 
FROM green_taxi_data
WHERE true
    AND date(lpep_pickup_datetime) = '2019-01-01'
    AND passenger_count = 3
"""

pd.read_sql(query, con=engine)

  passengers  count
0          2   1282
1          3    254

#### For the passengers picked up in the Astoria Zone which was the drop up zone that had the largest tip?

In [36]:
query = """
SELECT 
    zone
FROM green_taxi_data g
JOIN zones z
    ON g.do_location_id = z.location_id
WHERE tip_amount = (
    SELECT 
        max(tip_amount)
    FROM green_taxi_data g
    JOIN zones z
        ON g.pul_location_id = z.location_id
            AND z.zone = 'Astoria'
)    
"""

pd.read_sql(query, con=engine)

                            zone
0  Long Island City/Queens Plaza